app/controllers/applicants_controller.rb

  def index
    @applicants = Applicant.find(params[:recruiter_id])
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @applicant = Applicant.new(applicant_params)

    if @applicant.save
---
INSERT INTO "applicants" ("recruiter_id", "name", "position", "status", "location", "method", "traveling", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"