app/controllers/recruiters_controller.rb

SELECT "recruiters".* FROM "recruiters"
---
  def index
    @recruiters = Recruiter.all

INSERT INTO "recruiters" ("name", "team", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Jose"], ["team", "Sales"], ["created_at", "2019-02-11 01:29:15.689183"], ["updated_at", "2019-02-11 01:29:15.689183"]]
---
  def create
    @recruiter = Recruiter.new(recruiter_params)

    if @recruiter.save

SELECT  "recruiters".* FROM "recruiters" WHERE "recruiters"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "recruiters" WHERE "recruiters"."id" = $1  [["id", 5]]
---
  def destroy
    @recruiter = Recruiter.find(params[:id])

    if @recruiter
      @recruiter.destroy

SELECT  "recruiters".* FROM "recruiters" WHERE "recruiters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "recruiters" SET "name" = $1, "updated_at" = $2 WHERE "recruiters"."id" = $3  [["name", "Joe Kung"], ["updated_at", "2019-02-11 01:33:05.580232"], ["id", 1]]
---
  def update
    @recruiter = Recruiter.find(params[:id])

    if @recruiter.update_attributes(recruiter_params)